{
    "jobs": [{
        "company": "bank of america",
        "title" : "vp, cnslt apps prog - front end engineer",
        "startDate" : "2018-10-24",
        "endDate": "present",
        "city": "pennington",
        "state": "new jersey",
        "logo": "https://yt3.ggpht.com/a-/AAuE7mDxHmqWBN1JUzVUXHKQRzKjYAhUO6u7R1oRBQ=s900-mo-c-c0xffffffff-rj-k-no",
        "show": true,
        "desc": {
            "show": true,
            "copy": "Employed as a VP, Cnslt Apps Prog, I am a front end engineer who primarily works within a client facing transfer of assets section of Merrill Lynch. Additionally, I collaborate in research and development efforts in a company style guide."
        },
        "responsibilities": {
            "show": true,
            "copy": "front end engineer",
            "list": [
                "Individual front end contributor to www.mymerrill.com and www.merrilledge.com ",
                "Create UI mock ups from existing front end components.",
                "Develop and refactor gulp tasks to optimize less files into finalized css files to be served in production.",
                "Presented the idea of a companywide style guide at bi annual innovation summit.",
                "Develop client side handlebar templates consuming data passed from backend developers.",
                "Work with backend developers to get stub json data to mock service calls so development of handlebar templates can run in parallel of the backend api being built.",
                "Develop css using less.",
                "Structured less files to make imports easier to read/follow.",
                "Created POC of a styleguide utilizing vuepress as a static site generator.",
                "Participated in daily standup, quad sessions, story grooming sessions, sprint planning and sprint retrospectives.",
                "Train junior developers about nodejs, expressjs, client side and server side handlebar template rendering, npm, jQuery.",
                "Work with product owners to discuss UI options they have to when new features need to be implemented.",
                "Utilize Rally/Jira for story tracking."
            ]
        }
    },{
        "company": "brooks bell",
        "title" : "javascript developer",
        "startDate" : "2017-07-31",
        "endDate": "2018-02-06",
        "city": "raleigh",
        "state": "north carolina",
        "logo": "https://media.glassdoor.com/sqll/247760/brooks-bell-squarelogo-1464986694299.png",
        "show": true,
        "desc": {
            "show": true,
            "copy": "Employed as a JavaScript Developer, I am responsible for delivering front end web solutions for clients of Brooks Bell using primarily Adobe Target, as well as Optimizely and Monetate. Serving as the tech lead of Adobe Target mentoring a team of junior developers."
        },
        "responsibilities": {
            "show": true,
            "copy": "a-b test developer",
            "list": [
                "Facilitated Adobe Target campaign launches",
                "Implemented A/B Testing strategy for high volume Adobe Target campaign pushes",
                "Wrote a/b tests for SunTrust, Barnes & Noble, Toys R Us, Uber, American Express, Clinique, Nickelodeon and Oppenheimer Funds",
                "Train and mentor Junior/Intermediate level developers dom manipulation, modular javascript, css, a/b testing process, Adobe Target",
                "Adobe Target SME. Train developers and project managers on how to use Adobe Target",
                "Utilized Optimizely and Monetate as content delivery networks for a/b test scripts",
                "Utilized git version control",
                "Implemented code review process for Junior/Intermediate developers",
                "Preformed code reviews for Junior/Intermediate developers",
                "Interviewed candidates for full-time positions from a technical perspective"
            ]
        }
    },{
        "company": "lowe's home improvement",
        "title" : "software developer",
        "startDate" : "2015-01-12",
        "endDate": "2017-07-14",
        "city": "mooresville",
        "state": "north carolina",
        "logo": "https://img.grouponcdn.com/coupons/cCQ8NrxHNJAVMT9b5mmHh3/lowes-highres-500x500",
        "show": true,
        "desc": {
            "show": true,
            "copy": "Employed as a software developer, I was responsible for daily content updates, projects, a/b test development and analytics."
        },
        "responsibilities": {
            "show": true,
            "copy": "front end developer on the fed team",
            "list": [
                "Contributor to a team of developers and worked along side business partners to successfully implement an A/B testing process",
                "Research, analysis and development of front-end solutions and enhancements to lowes.com within a Kanban framework",
                "Develop solutions on top of Adobe Experience Manager (Adobe CQ, Adobe Test & Target, Adobe Recommendations, Adobe Sitecatalyst, Adobe Dynamic Tag Manager) to support business needs",
                "Agile SCRUM Development environment",
                "Utilize Atlassian Jira for agile project tracking",
                "Utilize Atlassian Confluence for documentation",
                "Utilized git version control",
                "Lead developer of A/B Tests on www.lowes.com and m.lowes.com utilizing Adobe Test and Target",
                "Advanced Integration between Frontend and Backend services using JSON and XML",
                "Contributor of analytics tagging on www.lowes.com and m.lowes.com utilizing Adobe DTM",
                "Broke down code for non-technical clients, provide extensive Q/A knowledge and testing, and manage tasking for our team",
                "Contributed to Lowes.com redesign, released in 2016",
                "Lead developer for front-end implementation of promotions and static content updates, site wide, released on a daily cadence ",
                "Debugged and provided solutions for impediments and small enhancements to lowes.com and m.lowes.com using Charles Proxy, HTML, CSS, JS, jQuery, handlebars and nodejs",
                "Participated in daily standup, quad sessions, story grooming sessions, sprint planning and sprint retrospectives",
                "Worked with others to develop and utilize user chat implementation for lowesforpros.com and lowes.com using Adobe DTM, live-person, javascript, html and css",
                "Mentor and Train Junior level developers",
                "Interviewed candidates for full-time positions from a technical perspective"
            ]
        }
    },{
        "company": "freelance",
        "title" : "freelance web developer",
        "startDate" : "2011-01-01",
        "endDate": "2017-01-01",
        "city": "cary",
        "state": "north carolina",
        "logo": "http://www.charbase.com/images/glyph/9634",
        "show": false,
        "desc": {
            "show": true,
            "copy": "During freelancing, I worked on a number of websites and side projects. These ranged from local pizzeria's to small weather app side projects."
        },
        "responsibilities": {
            "show": true,
            "copy": "web dev for cozzolinos",
            "list": [
                "Design and develop, as well as provide creative copy for static websites",
                "Specializing in HTML / CSS / Adobe Photoshop/Illustrator",
                "JavaScript (jQuery) / AJAX to build the front-end",
                "Created email marketing campaigns",
                "Created advertisements for both the web and print"
            ]
        }
    }]
}